# ViewGraphSchedOffGrid Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewGraphSchedOffGrid Property
ParameterTypeId Class See Also
---
"Include Off-Grid Columns"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewGraphSchedOffGrid { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewGraphSchedOffGrid As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewGraphSchedOffGrid {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace